/* automatically generated by rust-bindgen */

pub const BMA2x2_SPI_RD_MASK: u32 = 128;
pub const BMA2x2_I2C_ADDR1: u32 = 24;
pub const BMA2x2_I2C_ADDR2: u32 = 25;
pub const BMA2x2_I2C_ADDR3: u32 = 16;
pub const BMA2x2_I2C_ADDR4: u32 = 17;
pub const BMA2x2_FIFO_XYZ_DATA_ENABLED: u32 = 0;
pub const BMA2x2_FIFO_X_DATA_ENABLED: u32 = 1;
pub const BMA2x2_FIFO_Y_DATA_ENABLED: u32 = 2;
pub const BMA2x2_FIFO_Z_DATA_ENABLED: u32 = 3;
pub const BMA2x2_FIFO_DATA_ENABLED_MASK: u32 = 3;
pub const BMA2x2_EEP_OFFSET: u32 = 22;
pub const BMA2x2_IMAGE_BASE: u32 = 56;
pub const BMA2x2_IMAGE_LEN: u32 = 22;
pub const BMA2x2_CHIP_ID_ADDR: u32 = 0;
pub const BMA2x2_X_AXIS_LSB_ADDR: u32 = 2;
pub const BMA2x2_X_AXIS_MSB_ADDR: u32 = 3;
pub const BMA2x2_Y_AXIS_LSB_ADDR: u32 = 4;
pub const BMA2x2_Y_AXIS_MSB_ADDR: u32 = 5;
pub const BMA2x2_Z_AXIS_LSB_ADDR: u32 = 6;
pub const BMA2x2_Z_AXIS_MSB_ADDR: u32 = 7;
pub const BMA2x2_TEMP_ADDR: u32 = 8;
pub const BMA2x2_STAT1_ADDR: u32 = 9;
pub const BMA2x2_STAT2_ADDR: u32 = 10;
pub const BMA2x2_STAT_TAP_SLOPE_ADDR: u32 = 11;
pub const BMA2x2_STAT_ORIENT_HIGH_ADDR: u32 = 12;
pub const BMA2x2_STAT_FIFO_ADDR: u32 = 14;
pub const BMA2x2_RANGE_SELECT_ADDR: u32 = 15;
pub const BMA2x2_BW_SELECT_ADDR: u32 = 16;
pub const BMA2x2_MODE_CTRL_ADDR: u32 = 17;
pub const BMA2x2_LOW_NOISE_CTRL_ADDR: u32 = 18;
pub const BMA2x2_DATA_CTRL_ADDR: u32 = 19;
pub const BMA2x2_RST_ADDR: u32 = 20;
pub const BMA2x2_INTR_ENABLE1_ADDR: u32 = 22;

pub const BMA2x2_SLOW_NO_MOTION_ENABLE_SELECT: u32 = 3;
pub const BMA2x2_WAKE_UP_DURN_20MS: u32 = 0;
pub const BMA2x2_WAKE_UP_DURN_80MS: u32 = 1;
pub const BMA2x2_WAKE_UP_DURN_320MS: u32 = 2;
pub const BMA2x2_WAKE_UP_DURN_2560MS: u32 = 3;
pub const BMA2x2_SELFTEST0_ON: u32 = 1;
pub const BMA2x2_SELFTEST1_ON: u32 = 2;
pub const BMA2x2_EE_W_OFF: u32 = 0;
pub const BMA2x2_EE_W_ON: u32 = 1;
pub const BMA2x2_RESOLUTION_12_BIT: u32 = 0;
pub const BMA2x2_RESOLUTION_10_BIT: u32 = 1;
pub const BMA2x2_RESOLUTION_14_BIT: u32 = 3;
pub const BMA2x2: u32 = 22;
pub const BMA280: u32 = 23;
pub const BMA222E: u32 = 24;
pub const BMA250E: u32 = 25;
pub const LOW_G_SINGLE_AXIS_MODE: u32 = 0;
pub const LOW_G_SUMMING_MODE: u32 = 1;
pub const TAP_DURN_50_MS: u32 = 0;
pub const TAP_DURN_100_MS: u32 = 1;
pub const TAP_DURN_150_MS: u32 = 2;
pub const TAP_DURN_200_MS: u32 = 3;
pub const TAP_DURN_250_MS: u32 = 4;
pub const TAP_DURN_375_MS: u32 = 5;
pub const TAP_DURN_500_MS: u32 = 6;
pub const TAP_DURN_700_MS: u32 = 7;
pub const TAP_SHOCK_50_MS: u32 = 0;
pub const TAP_SHOCK_75_MS: u32 = 1;
pub const TAP_QUIET_30_MS: u32 = 0;
pub const TAP_QUIET_20_MS: u32 = 1;
pub const BMA2x2_ACCEL_DATA_SIZE: u32 = 2;
pub const BMA2x2_ACCEL_XYZ_DATA_SIZE: u32 = 6;
pub const BMA2x2_ACCEL_XYZ_TEMP_DATA_SIZE: u32 = 7;
pub const BMA2x2_SENSOR_DATA_ACCEL_LSB: u32 = 0;
pub const BMA2x2_SENSOR_DATA_ACCEL_MSB: u32 = 1;
pub const BMA2x2_SENSOR_DATA_XYZ_X_LSB: u32 = 0;
pub const BMA2x2_SENSOR_DATA_XYZ_X_MSB: u32 = 1;
pub const BMA2x2_SENSOR_DATA_XYZ_Y_LSB: u32 = 2;
pub const BMA2x2_SENSOR_DATA_XYZ_Y_MSB: u32 = 3;
pub const BMA2x2_SENSOR_DATA_XYZ_Z_LSB: u32 = 4;
pub const BMA2x2_SENSOR_DATA_XYZ_Z_MSB: u32 = 5;
pub const BMA2x2_SENSOR_DATA_TEMP: u32 = 6;
pub const BMA2x2_RESOLUTION_12_MASK: u32 = 240;
pub const BMA2x2_RESOLUTION_10_MASK: u32 = 192;
pub const BMA2x2_RESOLUTION_14_MASK: u32 = 252;
pub const BMA2x2_POWER_MODE_HEX_E_ZERO_MASK: u32 = 224;
pub const BMA2x2_POWER_MODE_HEX_4_ZERO_MASK: u32 = 64;
pub const BMA2x2_POWER_MODE_HEX_ZERO_ZERO_MASK: u32 = 0;
pub const BMA2x2_POWER_MODE_HEX_ZERO_ONE_MASK: u32 = 1;
pub const BMA2x2_POWER_MODE_HEX_ZERO_TWO_MASK: u32 = 2;
pub const BMA2x2_POWER_MODE_HEX_ZERO_FOUR_MASK: u32 = 4;
pub const BMA2x2_POWER_MODE_HEX_ZERO_SIX_MASK: u32 = 6;
pub type s8 = cty::c_schar;
pub type s16 = cty::c_short;
pub type s32 = cty::c_int;
pub type s64 = cty::c_longlong;
pub type u8 = cty::c_uchar;
pub type u16 = cty::c_ushort;
pub type u32 = cty::c_uint;
pub type u64 = cty::c_ulonglong;
#[doc = "\t@brief read accel xyz data for 10,14 and 12 bit resolution"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bma2x2_accel_data {
    #[doc = "< accel x data 10,14 and 12 resolution"]
    pub x: s16,
    #[doc = "< accel y data 10,14 and 12 resolution"]
    pub y: s16,
    #[doc = "< accel z data 10,14 and 12 resolution"]
    pub z: s16,
}
#[test]
fn bindgen_test_layout_bma2x2_accel_data() {
    assert_eq!(
        ::core::mem::size_of::<bma2x2_accel_data>(),
        6usize,
        concat!("Size of: ", stringify!(bma2x2_accel_data))
    );
    assert_eq!(
        ::core::mem::align_of::<bma2x2_accel_data>(),
        2usize,
        concat!("Alignment of ", stringify!(bma2x2_accel_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data>())).z as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data),
            "::",
            stringify!(z)
        )
    );
}
#[doc = "\t@brief read accel xyz data for 10,14 and 12 bit resolution"]
#[doc = "\tand temperature output"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bma2x2_accel_data_temp {
    #[doc = "< accel x data 10,14 and 12 resolution"]
    pub x: s16,
    #[doc = "< accel y data 10,14 and 12 resolution"]
    pub y: s16,
    #[doc = "< accel z data 10,14 and 12 resolution"]
    pub z: s16,
    #[doc = "< accel temperature data"]
    pub temp: s8,
}
#[test]
fn bindgen_test_layout_bma2x2_accel_data_temp() {
    assert_eq!(
        ::core::mem::size_of::<bma2x2_accel_data_temp>(),
        8usize,
        concat!("Size of: ", stringify!(bma2x2_accel_data_temp))
    );
    assert_eq!(
        ::core::mem::align_of::<bma2x2_accel_data_temp>(),
        2usize,
        concat!("Alignment of ", stringify!(bma2x2_accel_data_temp))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data_temp>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data_temp),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data_temp>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data_temp),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data_temp>())).z as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data_temp),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_accel_data_temp>())).temp as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_data_temp),
            "::",
            stringify!(temp)
        )
    );
}
#[doc = "\t@brief read accel xyz data for 8 bit resolution"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bma2x2_accel_eight_resolution {
    #[doc = "< accel x data with eight bit resolution"]
    pub x: s8,
    #[doc = "< accel y data with eight bit resolution"]
    pub y: s8,
    #[doc = "< accel z data with eight bit resolution"]
    pub z: s8,
}
#[test]
fn bindgen_test_layout_bma2x2_accel_eight_resolution() {
    assert_eq!(
        ::core::mem::size_of::<bma2x2_accel_eight_resolution>(),
        3usize,
        concat!("Size of: ", stringify!(bma2x2_accel_eight_resolution))
    );
    assert_eq!(
        ::core::mem::align_of::<bma2x2_accel_eight_resolution>(),
        1usize,
        concat!("Alignment of ", stringify!(bma2x2_accel_eight_resolution))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution>())).y as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution>())).z as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution),
            "::",
            stringify!(z)
        )
    );
}
#[doc = "\t@brief read accel xyz data for 8 bit resolution and temperature"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bma2x2_accel_eight_resolution_temp {
    #[doc = "< accel x data with eight bit resolution"]
    pub x: s8,
    #[doc = "< accel y data with eight bit resolution"]
    pub y: s8,
    #[doc = "< accel z data with eight bit resolution"]
    pub z: s8,
    #[doc = "< accel temperature data"]
    pub temp: s8,
}
#[test]
fn bindgen_test_layout_bma2x2_accel_eight_resolution_temp() {
    assert_eq!(
        ::core::mem::size_of::<bma2x2_accel_eight_resolution_temp>(),
        4usize,
        concat!("Size of: ", stringify!(bma2x2_accel_eight_resolution_temp))
    );
    assert_eq!(
        ::core::mem::align_of::<bma2x2_accel_eight_resolution_temp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(bma2x2_accel_eight_resolution_temp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution_temp>())).x as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution_temp),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution_temp>())).y as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution_temp),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution_temp>())).z as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution_temp),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<bma2x2_accel_eight_resolution_temp>())).temp as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_accel_eight_resolution_temp),
            "::",
            stringify!(temp)
        )
    );
}
#[doc = "  @brief FIFO data read is parsed and returned to user using this union."]
#[doc = ""]
#[doc = "  @note Read the respective data fields in the union for corresponding"]
#[doc = "  accel data axes enabled in FIFO storage( Axes stored in FIFO can be set"]
#[doc = "  by the data_select_bits in the register FIFO_CONFIG_1 )"]
#[doc = ""]
#[doc = "  data enabled for FIFO storage | Data field to be read from the below union"]
#[doc = "  ------------------------------|-------------------------------------------"]
#[doc = "          XYZ axes enabled      |         struct bma2x2_accel_data"]
#[doc = "          X axis data enabled   |         x data"]
#[doc = "          Y axis data enabled   |         y data"]
#[doc = "          Z axis data enabled   |         z data"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union fifo_frame {
    #[doc = " FIFO data stored here when XYZ data enabled in"]
    #[doc = "fifo_data_select bits of register 0x3E"]
    pub accel_data: bma2x2_accel_data,
    #[doc = " FIFO data stored here when accel X data enabled in"]
    #[doc = "fifo_data_select bits of register 0x3E"]
    pub x: s16,
    #[doc = " FIFO data stored here when accel Y data enabled in"]
    #[doc = "fifo_data_select bits of register 0x3E"]
    pub y: s16,
    #[doc = " FIFO data stored here when accel Z data enabled in"]
    #[doc = "fifo_data_select bits of register 0x3E"]
    pub z: s16,
    _bindgen_union_align: [u16; 3usize],
}
#[test]
fn bindgen_test_layout_fifo_frame() {
    assert_eq!(
        ::core::mem::size_of::<fifo_frame>(),
        6usize,
        concat!("Size of: ", stringify!(fifo_frame))
    );
    assert_eq!(
        ::core::mem::align_of::<fifo_frame>(),
        2usize,
        concat!("Alignment of ", stringify!(fifo_frame))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_frame>())).accel_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_frame),
            "::",
            stringify!(accel_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_frame>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_frame),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_frame>())).y as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_frame),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_frame>())).z as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_frame),
            "::",
            stringify!(z)
        )
    );
}
#[doc = "\t@brief bma2x2 initialization struct"]
#[doc = "\tstruct bma2x2_t is used for assigning the following parameters."]
#[doc = ""]
#[doc = "\tBus write function pointer: BMA2x2_WR_FUNC_PTR"]
#[doc = "\tBus read function pointer: BMA2x2_RD_FUNC_PTR"]
#[doc = "\tBurst read function pointer: BMA2x2_BRD_FUNC_PTR"]
#[doc = "\tDelay function pointer: delay_msec"]
#[doc = "\tI2C address: dev_addr"]
#[doc = "\tChip id of the sensor: chip_id"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bma2x2_t {
    #[doc = " save current bma2x2 operation mode"]
    pub power_mode_u8: u8,
    #[doc = " chip_id of bma2x2"]
    pub chip_id: u8,
    #[doc = " the value of power mode register 0x11"]
    pub ctrl_mode_reg: u8,
    #[doc = " the value of power mode register 0x12"]
    pub low_mode_reg: u8,
    #[doc = " initializes bma2x2's I2C device address"]
    pub dev_addr: u8,
    #[doc = " store the fifo configuration register"]
    pub fifo_config: u8,
    pub bus_write: ::core::option::Option<
        unsafe extern "C" fn(arg1: u8, arg2: u8, arg3: *mut u8, arg4: u8) -> s8,
    >,
    pub bus_read: ::core::option::Option<
        unsafe extern "C" fn(arg1: u8, arg2: u8, arg3: *mut u8, arg4: u8) -> s8,
    >,
    pub burst_read: ::core::option::Option<
        unsafe extern "C" fn(arg1: u8, arg2: u8, arg3: *mut u8, arg4: u32) -> s8,
    >,
    #[doc = " delay(in ms) function pointer"]
    pub delay_msec: ::core::option::Option<unsafe extern "C" fn(arg1: u32)>,
}
#[test]
fn bindgen_test_layout_bma2x2_t() {
    assert_eq!(
        ::core::mem::size_of::<bma2x2_t>(),
        40usize,
        concat!("Size of: ", stringify!(bma2x2_t))
    );
    assert_eq!(
        ::core::mem::align_of::<bma2x2_t>(),
        8usize,
        concat!("Alignment of ", stringify!(bma2x2_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).power_mode_u8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(power_mode_u8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).chip_id as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(chip_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).ctrl_mode_reg as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(ctrl_mode_reg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).low_mode_reg as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(low_mode_reg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).dev_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(dev_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).fifo_config as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(fifo_config)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).bus_write as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(bus_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).bus_read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(bus_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).burst_read as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(burst_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<bma2x2_t>())).delay_msec as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bma2x2_t),
            "::",
            stringify!(delay_msec)
        )
    );
}
#[doc = "  @brief FIFO configurations are stored in this structure"]
#[doc = ""]
#[doc = "  @note User should map the following before reading the FIFO data"]
#[doc = "    - buffer for storing the FIFO data should be mapped to the member"]
#[doc = "     \"fifo_data\" of this structure"]
#[doc = "    - Number of bytes to be read from the FIFO should be mapped to the member"]
#[doc = "     \"fifo_length\" of this structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fifo_configuration {
    #[doc = " Data buffer of user defined length is to be mapped here"]
    pub fifo_data: *mut u8,
    #[doc = " Index of accel data stored in FIFO buffer"]
    pub accel_byte_start_index: u8,
    #[doc = " No of bytes to be read in FIFO as specified by the user"]
    pub fifo_length: u8,
}
#[test]
fn bindgen_test_layout_fifo_configuration() {
    assert_eq!(
        ::core::mem::size_of::<fifo_configuration>(),
        16usize,
        concat!("Size of: ", stringify!(fifo_configuration))
    );
    assert_eq!(
        ::core::mem::align_of::<fifo_configuration>(),
        8usize,
        concat!("Alignment of ", stringify!(fifo_configuration))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_configuration>())).fifo_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_configuration),
            "::",
            stringify!(fifo_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<fifo_configuration>())).accel_byte_start_index as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_configuration),
            "::",
            stringify!(accel_byte_start_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fifo_configuration>())).fifo_length as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_configuration),
            "::",
            stringify!(fifo_length)
        )
    );
}
extern "C" {
    #[doc = " @brief"]
    #[doc = "\tThis API reads the data from"]
    #[doc = "\tthe given register continuously"]
    #[doc = ""]
    #[doc = ""]
    #[doc = "\t@param addr_u8 -> Address of the register"]
    #[doc = "\t@param data_u8 -> The data from the register"]
    #[doc = "\t@param len_u32 -> no of bytes to read"]
    #[doc = ""]
    #[doc = ""]
    #[doc = "\t@return results of bus communication function"]
    #[doc = "\t@retval 0 -> Success"]
    #[doc = "\t@retval -1 -> Error"]
    #[doc = ""]
    #[doc = ""]
    pub fn bma2x2_burst_read(addr_u8: u8, data_u8: *mut u8, len_u32: u32) -> s8;
}
extern "C" {
    #[doc = "\t@brief"]
    #[doc = "\tThis function is used for initialize"]
    #[doc = "\tbus read and bus write functions"]
    #[doc = "\tassign the chip id and device address"]
